app/Services/BlocksService.php

select * from `areas`
select * from `blocks` where `area_id` = '1' order by `recommend` desc
---
    public function allBuildingBlock()
    {
        // 获取所有区域
        $areas = Area::get();

        $data = array();
        foreach ($areas as $area) {
            $block_box = array();
            $blocks = Block::where('area_id', $area->id)->orderBy('recommend', 'desc')->get();