app/Services/LoginsService.php

select * from `admins` where (`name` = 'admin@chulouwang.com') limit 1
---
    public function adminLogin($request)
    {
        $admin = Admin::where(['name' => $request->name,])->first();

select * from `oauth_access_tokens` where `oauth_access_tokens`.`id` = '8a530dbc8b867f0dfa45f0afa20a0283d894b18fa57427e79b13304d58a956fcc4a6092113dcb8f1' limit 1
delete from `oauth_access_tokens` where `id` = '8a530dbc8b867f0dfa45f0afa20a0283d894b18fa57427e79b13304d58a956fcc4a6092113dcb8f1'
---
    public function logout($guard)
    {
        $user = Auth::guard($guard)->user();
        if (empty($user)) return ['status' => false, 'message' => '暂未登录'];

        $accessToken = $user->access_token;
        $token = Token::find($accessToken);
        if (empty($token)) return ['status' => false, 'message' => '暂无有效令牌'];

        if (!empty($token->delete())) {