app/Services/ServicesService.php

select * from `services` where (`show` = '1' and `shelf` = '1') and `services`.`deleted_at` is null order by `weight` asc
---
    public function getServices()
    {
        $allServices = Service::orderBy('weight', 'asc')->where([
            'show' => 1,
            'shelf' => 1
        ])->get();