app/Http/Controllers/API/Admin/RolesController.php

select `name` from `media`.`permissions` inner join `media`.`role_has_permissions` on `media`.`permissions`.`id` = `media`.`role_has_permissions`.`permission_id` where `media`.`role_has_permissions`.`role_id` = '1'
---
    public function edit(
        Role $role
    )
    {
        // 角色所有权限
        $role->oldPermissions = $role->permissions()->pluck('name')->toArray();