<?php
/**
 * Created by PhpStorm.
 * User: luozhen
 * Date: 2018/3/12
 * Time: 上午11:54
 */
Route::group(['namespace' => 'Admin', 'prefix' => 'admin'], function () {

    // 七牛token
    Route::get('/get_qi_niu_token', 'BannerController@token');

    /*
    |--------------------------------------------------------------------------
    | banner管理
    |--------------------------------------------------------------------------
    */
    Route::resource('banners','BannerController');

    /*
    |--------------------------------------------------------------------------
    | 服务管理
    |--------------------------------------------------------------------------
    */
    Route::resource('services', 'ServicesController');


    /*
    |--------------------------------------------------------------------------
    | 精品推荐管理
    |--------------------------------------------------------------------------
    */
    Route::resource('recommends', 'RecommendsController');
    //获取楼盘下拉数据
    Route::get('buildings_select', 'RecommendsController@buildingsSelect');

    /*
    |--------------------------------------------------------------------------
    | 系统公告管理
    |--------------------------------------------------------------------------
    */
    Route::resource('system_notices', 'SystemNoticesController');

    /*
    |--------------------------------------------------------------------------
    | 热门商圈管理
    |--------------------------------------------------------------------------
    */
    Route::resource('hot_blocks', 'HotBlocksController');

    /*
    |--------------------------------------------------------------------------
    | 楼盘推荐管理
    |--------------------------------------------------------------------------
    */
    Route::resource('building_recommends', 'BuildingRecommendsController');

    /*
    |--------------------------------------------------------------------------
    | 推荐服务管理
    |--------------------------------------------------------------------------
    */
    Route::resource('service_recommends', 'ServiceRecommendsController');
    // 服务下来数据
    Route::get('service_select', 'ServiceRecommendsController@serviceSelect');

    /*
    |--------------------------------------------------------------------------
    | 楼盘特色管理
    |--------------------------------------------------------------------------
    */
    Route::resource('building_features', 'BuildingFeaturesController');

    /*
    |--------------------------------------------------------------------------
    | 房源特色管理
    |--------------------------------------------------------------------------
    */
    Route::resource('house_features', 'HouseFeaturesController');

    /*
    |--------------------------------------------------------------------------
    | 楼盘管理
    |--------------------------------------------------------------------------
    */
    Route::resource('buildings', 'BuildingsController');

    /*
    |--------------------------------------------------------------------------
    | 房源管理
    |--------------------------------------------------------------------------
    */
    Route::resource('houses', 'HousesController');
});