app/Repositories/AreasRepository.php

select * from `areas`
---
    public function areaList()
    {
        return Area::all();