app/Repositories/BannerRepository.php

    public function bannerList()
    {
        return Banner::first();
---
select * from `banners` where `banners`.`deleted_at` is null