app/Repositories/BuildingRecommendsRepository.php

select * from `areas` where `areas`.`id` in ('4')
select * from `blocks` where `blocks`.`id` in ('37')
select * from `building_recommends` where `building_recommends`.`deleted_at` is null
select * from `buildings` where `buildings`.`id` in ('35', '48')
---
    public function recommendList($service)
    {
        $buildingRecommend =  BuildingRecommend::with('building', 'building.area', 'building.area.city', 'building.block', 'building.house')->get();