app/Repositories/BuildingsRepository.php

    public function buildingList(
        $request,
        $service,
        $building_id = null,
        $whetherPage = null
    )
    {
        // 取得符合条件房子
        $houses = $this->houseList($request, $building_id);

        // 根据楼盘分组
        $buildings = $this->groupByBuilding($houses);

        $buildingData = Building::whereIn('id', $buildings->keys())->with(['block', 'features', 'area', 'label', 'house'])->get();
---
select * from `areas` where `areas`.`id` in ('1', '2', '4', '6', '7')
select * from `blocks` where `blocks`.`id` in ('1', '3', '5', '7', '12', '37', '38', '39', '41', '43', '45', '60', '64')
select * from `buildings` where `id` in ('23', '4', '78', '68', '40', '10', '20', '77', '17', '35', '12', '59', '9', '11', '44', '73', '31', '13', '79', '36', '51', '30', '7', '53', '49', '16', '42', '86', '22', '19', '88', '89', '57', '91', '55', '47', '93', '94', '95', '48', '96', '41', '8', '98', '39', '101', '24', '52', '92', '106', '3', '107', '1', '110', '112', '114', '117', '103', '118', '15', '25', '120', '74', '122', '34', '124', '127', '105', '132', '133', '99', '135', '2', '134', '26')

        }

        // 筛选出符合条件的楼座
        $buildingBlocks = BuildingBlock::whereIn('building_id', $buildings)->pluck('id')->toArray();
---
select `id` from `building_blocks` where `building_id` in ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '20', '21', '22', '23', '24', '25', '26', '27', '28', '29', '30', '31', '32', '33', '34', '35', '36', '37', '38', '39', '40', '41', '42', '43', '44', '45', '46', '47', '48', '49', '50', '51', '52', '53', '54', '55', '56', '57', '58', '59', '60', '61', '62', '63', '64', '65', '66', '67', '68', '69', '70', '71', '72', '73', '74', '75', '76', '77', '78', '79', '80', '81', '82', '83', '84', '85', '86', '87', '88', '89', '90', '91', '92', '93', '94', '95', '96', '97', '98', '99', '100', '101', '102', '103', '104', '105', '106', '107', '108', '109', '110', '111', '112', '113', '114', '115', '116', '117', '118', '119', '120', '121', '122', '123', '124', '125', '126', '127', '128', '129', '130', '131', '132', '133', '134', '135', '136', '137', '138', '139')

    public function groupByBuilding($houses)
    {
        // 对楼座进行分组
        $buildingsBlocks = $houses->get()->groupBy('building_block_id');
        // 将房源根据
        $buildingsBlockIds = $buildingsBlocks->keys();
        $buildingsBlocksData = BuildingBlock::find($buildingsBlockIds);
        foreach ($buildingsBlocks as $index => $buildingsBlock) {
            // 当前的楼座
            $buildingBlockCurr = $buildingsBlocksData->find($index);
---
select * from `building_blocks` where `building_blocks`.`id` in ('1', '7', '33', '74', '76', '77', '75', '79', '2', '82', '52', '51', '87', '98', '12', '3', '111', '14', '113', '114', '115', '118', '119', '120', '121', '90', '92', '85', '93', '123', '124', '13', '25', '126', '69', '129', '142', '26', '159', '157', '23', '160', '161', '88', '46', '169', '64', '116', '94', '8', '112', '174', '140', '180', '125', '95', '184', '185', '128', '186', '187', '189', '190', '5', '104', '191', '192', '193', '107', '134', '196', '197', '198', '199', '204', '205', '207', '208', '97', '209', '6', '122', '213', '212', '214', '83', '220', '127', '221', '224', '225', '227', '29', '229', '231', '230', '203', '237', '132', '80', '239', '240', '210', '243', '219', '246', '18', '91', '252', '250', '253', '255', '110', '259', '260', '130', '99', '261', '256', '262', '263', '265', '173', '89', '158', '268', '131', '172', '270', '247', '271', '136', '274', '81', '275', '277', '100', '278', '279', '235', '284', '15', '234', '236', '379', '328', '381', '222', '264', '383', '362', '117', '385', '101', '206', '319', '272', '267', '382', '354')