app/Repositories/EmployeesRepository.php

select * from `employees` limit 1 offset 0
select count(*) as aggregate from `employees`
---
    public function getList($request)
    {
        return Employee::paginate($request->per_page);

update `employees` set `name` = '刘坤涛', `tel` = '15926289802', `updated_at` = '2018-06-19 16:37:53' where `id` = '2'
---
    public function updateWechat($data)
    {
        return Employee::where('id', $data['id'])->update(['openid',$data['openid']]);