app/Repositories/HotBlocksRepository.php

    public function hotBlocksList()
    {
        return HotBlock::orderBy('sort', 'asc')->with('block')->get();
---
select * from `hot_blocks` where `hot_blocks`.`deleted_at` is null order by `sort` asc