app/Repositories/MediaUsersRepository.php

    public function updateUser(
        $id,
        $request
    )
    {
        \DB::connection('media')->beginTransaction();
        try {
            $user = User::find($id);
            $user->level = $request->level;
            if (!$user->save()) throw new \Exception('用户角色修改失败');
---
select * from `users` where `users`.`id` = '3' limit 1
update `users` set `level` = '1', `updated_at` = '2018-06-20 16:53:45' where `id` = '3'