app/Repositories/PermissionsRepository.php

select * from `media`.`permissions` where (`guard_name` = 'web') limit 10 offset 10
select count(*) as aggregate from `media`.`permissions` where (`guard_name` = 'web')
---
    public function permissionsList()
    {
        return Permission::where(['guard_name' => 'web'])->paginate(10);

select * from `permission_groups` where (`stage` = '1')
---
    public function permissionsGroup()
    {
        return MediaPermissionGroup::where(['stage' => 1])->get();