app/Repositories/PermissionGroupsRepository.php

    public function permissionGroupsList(
        $request
    )
    {
        return PermissionGroup::where(['stage' => 1])->paginate($request->per_page??10);
---
select * from `permission_groups` where (`stage` = '1') limit 10 offset 0
select count(*) as aggregate from `permission_groups` where (`stage` = '1')