app/Repositories/RecommendsRepository.php

select * from `recommends` where `recommends`.`deleted_at` is null
---
    public function recommendsList()
    {
        return Recommend::all();