app/Repositories/RolesRepository.php

    public function roleList()
    {
        return Role::where(['guard_name' => 'web'])->paginate(10);
---
select * from `media`.`roles` where (`guard_name` = 'web') limit 10 offset 0
select count(*) as aggregate from `media`.`roles` where (`guard_name` = 'web')

    public function getAllPermissions()
    {
        // 获取所有权限组
        $groups = MediaPermissionGroup::where(['stage' => 1])->get();
---
select * from `permission_groups` where (`stage` = '1')