app/Repositories/ServiceRecommendsRepository.php

    public function getList()
    {

         $first = ServiceRecommend::where('weight', '=', '1')->orderBy('weight', 'asc')->with('service')->get()->toArray();
         // 如果权重1的不存在 返回一个空对象
         if(!$first){
              $first[0] = (object)null;
         }
         $second = ServiceRecommend::where('weight', '!=', '1')->orderBy('weight', 'asc')->with('service')->get()->toArray();
---
select * from `service_recommends` where `weight` = '1' and `service_recommends`.`deleted_at` is null order by `weight` asc
select * from `services` where `services`.`id` in ('2') and `services`.`deleted_at` is null
select * from `service_recommends` where `weight` != '1' and `service_recommends`.`deleted_at` is null order by `weight` asc
select * from `services` where `services`.`id` in ('3', '6', '8') and `services`.`deleted_at` is null