app/Repositories/SystemNoticesRepository.php

select * from `system_notices` where `system_notices`.`deleted_at` is null
---
    public function SystemNoticesList()
    {
        return SystemNotice::all();