app/Repositories/UsersRepository.php

    public function usersList($request)
    {
        return User::withCount('Bespeak')->withCount('ThrowIn')->get();
---
select count(*) as aggregate from `users`